{
    "general": {
        "direction": "rtl"
    },
    "main_page": {
        "spn_main_page_title": "بیت‌کوین از پایه",
        "spn_main_page_desc": "راهنمای ساختن کلیدخصوصی (همان ۲۴کلمه رمز) بیت‌کوین با امنیت بالا و آموزش روش استفاده از کیف‌پول بیت‌کوین الکترام",
        "spn_main_page_step_one_title": "چرا روش تولید کلید خصوصی بیت‌کوین مهم است",
        "spn_main_page_step_one_desc": "در این قسمت «کلید خصوصی» یا ۲۴کلمه رمز بیت‌کوین به زبان ساده توضیح داده شده و دلیل  اینکه ساختن آن کار بسیار ساده ولی حساسی است صحبت شده. قبل از ساختن رمز خود حتما این بخش را مطالعه کنید.",
        "spn_main_page_step_two_title": "گام اول: تولید ۲۴کلمه رمز بیت‌کوین به کمک تاس",
        "spn_main_page_step_two_desc": "برای ساختن کلید خصوصی بیت‌کوین خودتون نیاز به یک یا چند تاس سالم و کمی صبر و حوصله دارید. برای امنیت بیشتر حتما باید اینترنت دستگاه خودتون رو قطع کنید.",
        "spn_main_page_step_three_title": "گام دوم: روش استفاده از کیف‌پول الکترام",
        "spn_main_page_step_three_desc": "حالا که کلید خصوصی خودتون رو ساختید می‌تونید با روش های گوناگون ازش برای دریافت و ارسال بیت‌کوین استفاده کنید. کیف پول الکترام یکی از روش های پیشنهاد شده است.",
        "spn_main_page_step_four_title": "گام‌های بعدی؛ فول‌نود و پرایوسی در شبکه بیت‌کوین",
        "spn_main_page_step_four_desc": "شما تونستید به روش درست کلید خصوصی درست کنید و خودتون از بیت‌کوین‌هاتون نگهداری کنید. مرحله چهارم درباره روش‌های حفاظت از قوانین بیت‌کوین و نقش شما در کمک به این کار صحبت می‌کنه.",
        "spn_main_page_splash_first_section": "این نرم‌افزار اپن‌سورس و رایگان با هدف آموزش مفاهیم پایه‌ای بیت‌کوین تهیه شده و شامل دو بخشه:<br/><b>بخش آموزشی: </b>در این بخش مفاهیم پایه‌ای بیت‌کوین از کلید خصوصی و اهمیت روش ساختن اون تا آموزش تصویری کیف‌پول التکرام پوشش داده شده و مطالعه اون برای همه علاقمندان به بیت‌کوین مفید خواهد بود.<br/><b>ابزار تولید کلید خصوصی بیت‌کوین: </b> این بخش برای افراد حرفه‌ای طراحی شده تا بتونن کلید خصوصی خودشون رو با کمک تاس تولید کنن. استفاده از این ابزار برای افراد مبتدی و کسانی که نمی‌تونن اصالت فایل دانلود شده رو از طریق امضای دیجیتالی بسنجن بهیچوجه توصیه نمی‌شه.",
        "spn_main_page_splash_second_section": "هر نرم‌افزاری که روی کامپیوتر شما اجرا می‌شه (چه بصورت وبسایت چه اپلیکیشن دستکاپ) باید از نظر اصالت بررسی بشه وگرنه عواقب ناگواری به همراه خواهد داشت. بیشتر اوقات ما کاربران نرم‌افزار بدلایل مختلف: تنبلی، رایگان بودن نرم‌افزار یا نداشتن دانش کافی قبل از نصب، زحمت تایید اصالت رو به خودمون نمی‌دیم. این روش برای ما مشکلی بوجود نمیاره تا جایی که پای دارایی و پول وسط باشه. اگر می‌خواهید از ابزار تولید کلید خصوصی استفاده کنید حتما از اصالت فایلی که دانلود کردید مطمئن بشوید. کلید عمومی موردنیاز برای تایید اصالت رو از پوشه gpg-pub-key در صفحه گیت‌هاب پروژه دانلود و امضای دیجیتالی که همراه فایل‌های بخش release هستند رو برای تایید اصالت فایلهای دانلود شده بررسی کنید.",
        "spn_main_page_splash_third_section": "این اپلیکیشن نیازی به اینترنت نداره. برای اطمینان خاطر می‌تونید شبکه داخلی و اینترنت دستگاهتون رو در حالی که دارید ازش استفاده می‌کنید قطع کنید و پیغام‌های فایروال رو cancel کنید. اگر بعد از تایید اصالت فایل دانلود شده تصمیم گرفتید از ابزار تولید کلید خصوصی بیت‌کوین به کمک تاس استفاده کنید، لازمه قبل از وارد شدن به اون بخش، اینترنت و شبکه دستگاه‌تون رو قطع کنید.",
        "spn_main_page_splash_forth_section": "روش تولید کلید خصوصی در اینجا از روش تست شده و اپن‌سورس پروتکل گلیسیر برداشته شده. برای اطلاعات بیشتر بر روی آیکون این پروژه در صفحه اصلی کلیک کنید.",
        "btn_close_modal": "ادامه",
        "btn_close_modal_and_forget": "دوباره اخطار نده",
        "spn_main_page_footer_message": "در صفحه «اطلاعات بیشتر» می‌تونید آدرس گیت‌هاب و اطلاعات تماس رو ببینید",
        "spn_main_page_footer_twitter_handle":"bfsapp@",
        "spn_main_page_more_information":"اطلاعات بیشتر",
        "spn_main_page_more_information_content_page_header":"درباره این نرم‌افزار و اطلاعات بیشتر"
    },
    "content_pages": {
        "spn_back_to_home_title": " صفحه اصلی"
    },
    "seed_gen": {
        "spn_help_step_initial": "تاس(ها) را آماده کنید و مطمئن شوید اینترنت تا آخرین مرحله قطع است. برای شروع روی دکمه استارت کلیک کنید",
        "div_help_step_dice_roll": "باید نتیجه ۱۰۰ بار پرتاب تاس را در مجموعه‌های ۵تایی وارد کنید. اگر بیشتر از یک تاس دارید حتما تاس ها را از چپ به راست بخوانید و از وارد کردن تصادفی اعداد پرهیز کنید. بعد از وارد کردن اعداد در هر دور، با زدن دکمه قرمز + آنها را ثبت کنید. اینکار را ۲۰ بار تکرار کنید.",
        "div_help_step_gen_computer_rndm": "مرحله پرتاب تاس با موفقیت انجام شد. حالا باید یک عدد تصادفی از کامپیوتر شما بگیریم و کلید خصوصی رو بسازیم. روی دکمه آبی زیر کلیک کنید و برای کمک به تولید بی‌نظمی نشانگر موس خودتون رو تا انتهای این مرحله روی صفحه حرکت بدید.",
        "div_help_step_success": "کلید خصوصی شما ساخته شد و همه اطلاعات این صفحه بعد از بستن این پنجره حذف می‌شه. برای اطمینان بیشتر می‌تونید قبل از اینکه اینترنت رو دوباره وصل کنید، فولدر این نرم‌افزار رو از روی دستگاهتون کاملا پاک کنید.",
        "div_help_warning": "تحت هیچ شرایطی کلید خصوصی و/یا کلمات رمزتون رو جایی توی این سیستم ذخیره نکنید و فقط روی کاغذ بنویسید. عواقب لو رفتن کلید خصوصی خیلی سنگینه و بیت‌کوین‌هاتونو از دست می‌دید. گام دوم این راهنما روش استفاده از کلید خصوصی شما در والت الکترام رو آموزش می‌ده.",
        "dice_roll_result": "نتایج پرتاب تاس",
        "all_random_numbers": "اعداد تصادفی تولید شده<br/> از تاس و کامپیوتر",
        "private_key_text": "کلید خصوصی بیت‌کوین",
        "bip39_seed": "(SEED)<br/>BIP39 Mnemonic",
        "spn_connection_state_error": "برای حفظ امنیت کلید خصوصی، سیستم شما باید آفلاین باشد.<br/>شبکه بی‌سیم و کابل شبکه را قطع کنید و بعد از بستن برنامه، از اول شروع کنید.",
        "spn_seed_gen_consent_message": "مهم: اگر از اصالت این نرم‌افزار اطمینان ندارید فقط برای تست ازش استفاده کنید",
        "spn_seed_gen_consent_continue": "ابزار تولید کلید خصوصی را اجرا کن"
    }
}

